# SPDX-FileCopyrightText: Copyright (c) 2024-2025 NVIDIA CORPORATION & AFFILIATES. All rights reserved.
# SPDX-License-Identifier: Apache-2.0
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
# http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

backend: "python"
# TODO: Tune dynamic batcher
max_batch_size: 64
dynamic_batching {}


parameters {
  key: "tokenizer_dir"
  value: {
    string_value: "/workspace/examples/python/llm/tensorrtllm/operators/hf_downloads/llama-3.1-8b-instruct"
  }
}

#parameters {
#  key: "skip_special_tokens"
#  value: {
#    string_value: "${skip_special_tokens}"
#  }
#}

instance_group [
    {
        count: 10
        kind : KIND_CPU
    }
]